xml/requestMoto.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://drswbo05.allianz.com.br/V1_00_00/ws" xmlns:sch="http://drswbo05.allianz.com.br/V1_00_00/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:cotacaoRequest>
         <sch:autenticacao>
            <sch:usuario>BA262880</sch:usuario>
            <sch:parceiro>BP002617</sch:parceiro>
            <sch:mediador>0617120</sch:mediador>
         </sch:autenticacao>
         <sch:dadosFiscais>
            <sch:isentoIOF>false</sch:isentoIOF>
         </sch:dadosFiscais>
         <sch:dadosGerais>
            <sch:dataInicio>2019-02-20</sch:dataInicio>
            <sch:percentualComissao>30</sch:percentualComissao>
            <sch:agravoDesconto>
               <sch:percentualDesconto>20</sch:percentualDesconto>
            </sch:agravoDesconto>
         </sch:dadosGerais>
         <sch:dadosRisco>
            <sch:nomeTomador>ADEMILSON APARECIDO DE SOUZA</sch:nomeTomador>
            <sch:documentoTomador>15634766818</sch:documentoTomador>
            <sch:nomeCondutor>CARLA CAVALCANTE</sch:nomeCondutor>
            <sch:documentoCondutor>31797313894</sch:documentoCondutor>
            <sch:dataNascimento>1974-06-17</sch:dataNascimento>
         </sch:dadosRisco>
         <sch:veiculo>
            <sch:chassi>95V3V8F5HJM000364</sch:chassi>
            <sch:anoModelo>2018</sch:anoModelo>
            <sch:situacaoVeiculo>
               <sch:zeroKm>
                  <sch:dataNotaFiscal>2019-02-20</sch:dataNotaFiscal>
                  <sch:placa>GGL2729</sch:placa>
               </sch:zeroKm>
            </sch:situacaoVeiculo>
            <sch:codigoMarcaModelo>27800067</sch:codigoMarcaModelo>
            <sch:codigoFipe>0054836</sch:codigoFipe>
            <sch:percentualFipe>100</sch:percentualFipe>
            <sch:cepPernoite>04145000</sch:cepPernoite>
            <sch:tipoFranquia>REDUZIDA</sch:tipoFranquia>
            <sch:dispositivoAtual>200</sch:dispositivoAtual>
            <sch:despesasExtraordinarias>false</sch:despesasExtraordinarias>
         </sch:veiculo>
         <sch:ramo>
            <sch:moto>
               <sch:categoriaRisco>260</sch:categoriaRisco>
               <sch:questionario>
                  <sch:sexo>FEMININO</sch:sexo>
                  <sch:estadoCivil>212</sch:estadoCivil>
                  <sch:tempoHabilitacao>941</sch:tempoHabilitacao>
                  <sch:existeMenor25anos>1225</sch:existeMenor25anos>
                  <sch:garagemFaculdade>250</sch:garagemFaculdade>
                  <sch:garagemResidencia>233</sch:garagemResidencia>
                  <sch:garagemTrabalho>242</sch:garagemTrabalho>
                  <sch:condutorPrincipalResideEm>272</sch:condutorPrincipalResideEm>
               </sch:questionario>
               <!--Optional:-->
               <sch:coberturas>
                  <!--Optional:-->
                  <sch:valorAcessorio>1000.00</sch:valorAcessorio>
               </sch:coberturas>
            </sch:moto>
         </sch:ramo>
      </ws:cotacaoRequest>
   </soapenv:Body>
</soapenv:Envelope>